<?php
/////////////////////////////////

$a = 3;
if ( $a > 0 && $a < 5){
    echo 'verno';
}else {
    echo 'ne verno';
}
///////////////////////////////////
//$var = true;
//$a = 3;
//if ( $var == true){
//    echo 'verno';
//}else {
//    echo 'ne verno';
//}

/////////////////////
$arr = [
    'ru' => [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'],
    'en' => [1=>'pn', 2=>'vt', 3=>'sr', 4=>'cht', 5=>'pt', 6=>'sb', 7=>'vs'],

];
echo $arr['ru'][1]."<br>".$arr['en'][3]."<br>";
//////////////////////
//$arr = [
//    'cms'=>['joomla', 'wordpress', 'drupal'],
//    'colors'=>['blue'=>'голубой', 'red'=>'красный', 'green'=>'зеленый']
//];
//echo $arr['cms'][0].$arr['cms'][2];

/////////////////////////////////////////////
//$arr = [1=>'пн', 2=>'вт', 3=>'ср', 4=>'чт', 5=>'пт', 6=>'сб', 7=>'вс'];
//$day =3;
//echo $arr[$day];

//$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
//echo $arr['Коля'] . $arr['Петя'] ."<br>";


/////////////////////////////////////
//$arr = ['a'=>1, 'b'=>2, 'c'=>3];
//echo $arr['a'] + $arr['b'] + $arr['c']."<br>";
//////////////////////////
//$arr = ['a'=>1, 'b'=>2, 'c'=>3];
//echo $arr['c']."<br>";
//
///////////////////////////////////////
//$arr = [2, 5, 3, 9];
//$result = $arr[0] * $arr[1] + $arr[2] * $arr[3];
//echo $result."<br>";


//////////////////////////
//$arr=['a', 'b', 'c', 'd'];
//echo $arr[0].'+'.$arr[1];
//echo '+'.$arr[3].'<br>';
//echo $arr[2].'<br>';
//$arr = [
//    'ru'=>['голубой', 'красный', 'зеленый'],
//    'en'=>['blue', 'red', 'green'],
//];
//var_dump($arr['ru'][]);
//$arr = [
//    0=>['name'=>'Коля', 'salary'=>300],
//    1=>['name'=>'Вася', 'salary'=>400],
//    2=>['name'=>'Петя', 'salary'=>500],
//];
//
//   echo  $arr [1] ['name'].' -- ';
////   echo  $arr [1]['salary'];
//echo  "<br>";
//foreach ( $arr as $elem){
//
//    echo $elem['name'] .'-'. $elem['salary'] . '<br>';
//}



////////// Если строка начинается на  http:// то она выведется в противном
///  случае пропуститься
//$arr = ['http://google.com', 'https://youtube.com', 'https://vk.com'];
//$newArr = [];
//foreach ($arr as $elem) {
//    $pos = strpos($elem, 'http://');
//    if ($pos !== false) {
//        $newArr[] = $elem;
//    }
//}
//
//var_dump($newArr);
////////////////////////////
$num = 35 ;
$flag = false;
for ($i = 2; $i < $num; $i++) {
    if  ($num % $i == 0) {
        $flag =true;
        break;
    }
}

if ( $flag == true) {
    echo ('простое число');
}else {
    echo ('сложное число');
}
//echo $str .' выводит строку с числами ';echo "<br>";

//Сделайте функцию, противоположную функции array_unique. Ваша функция должна
// оставлять дубли и удалять элементы, не имеющие дублей. Скрыть решение.
	$arr = [1, 1, 1, 2, 3, 3, 4 ,5, 1, 6, 1, 3];
	$newArr = [];
	$elems = count($arr);
	for ($i = 0; $i < $elems; $i++) {
        $value = $arr[$i];
        unset($arr[$i]);
        if (in_array($value, $arr)) {
            $newArr[] = $value;
        }
        $arr[$i] = $value;
    }
	$arr = $newArr;
	echo var_dump($arr);
    echo "<br>";
///////////////////////////////////////////
function getArrUnique ($arr)
{
    $result = [];
    foreach ($arr as $elem) {
        if (in_array($elem, $result) == false) {
            $result[] = $elem;
        }
    }
    return $result;
}

///////////////////////////////////////////
$str = '12345678';
$newStr = array_reverse(str_split(strrev($str), 2));
echo implode('', $newStr).'выводит числа наоборот то есть 1 меняется с 2 а 3 меняется с 4 и т.д.';
echo "<br>";

/////////////////////////////////////////////
//echo $sum . 'выводит  Пример: [1, 3, 2, 4] превратится в [1, 3, 3, 3, 2, 2, 4, 4, 4, ';
$arr = [1,2,3,5];
$newArr = [];
foreach ($arr as $elem) {
    for ( $i=1 ; $i <=$elem ; $i++) {
        $newArr [] = $elem;}
}
var_dump($newArr);
echo "<br>";

/////////////////////////////////////////////
for ($i = 1; $i <= 5; $i++) {
    echo str_repeat($i , $i). '<br>';
}

/////////////////////////////////////////////
$str = 'apple';
$numStr = count(str_split($str, 1));
echo $numStr. '<br>';


//////////////////Заполните двумерный массив случайными числами от 1 до 10.
///  В каждом подмассиве должно быть по 10 элементов. Должно быть 10 подмассивов
//$arr = [];
//for ($i = 0; $i < 10; $i++) {
//    for ($j = 0; $j < 10; $j++)
//        $arr[$i][] = mt_rand(1, 10);
//}
//
//var_dump($arr);


////////////////////////////////////////////
$arr = [
    0=>['name'=>'Коля', 'salary'=>300],
    1=>['name'=>'Вася', 'salary'=>400],
    2=>['name'=>'Петя', 'salary'=>500],

];echo 'массив из которого берем ключ и значение и выводим в строчку'."<br>";

foreach($arr as $key => $elem ) {
    echo $elem['name'] .'-'. $elem['salary']. '<br>';
}

////////////////////////////////////////////
$str = '';
for ($i = 1; $i <= 10; $i++) {
    for ($j = 1; $j <= $i; $j++) {
        $str .= $i;
    }
}
echo $str .' выводит строку с числами ';echo "<br>";


///////////////////////////////////////
$arr = [1,2,3,4,5,6,7,8,45,45,23,76,23];
$sum = 0;
foreach ($arr as $elem) {
    if ($elem > 0 and $elem < 10)
        $sum += $elem;
}

echo $sum . 'выводит  сумму элементов массива которые больше 0 и меньше 10';
echo "<br>";


//////////////////////////////////////
$arr = [1,2,3,4,5,6,7,8];
$sum = 0;
foreach($arr as $elem) {
    $sum += $elem *$elem;
}
echo  floor(sqrt($sum)). 'корень без дробной части суммы квадратов элементов этого массива ';
echo "<br>";


/////////////////////////////////////////////////
$arr = [1,2,3,4,5,6,7,8];
$sum = 0;
$sum1= 0;
foreach($arr as $elem) {
    $sum += $elem;
    $sum1 += $elem *$elem;
}
echo ($sum). ' сумма всех элементов массива '. ($sum1). ' и сумма квадратов элементов этого массива ';
echo "<br>";



////////////////////  ЗАПИСЫВАЕТ В МАССИВ СТРОКУ ИЗ 6 БУКВ
$str = '';
for ($i = 0; $i < 6; $i++) {
    $str .= rand(1, 9);
}
var_dump($str);
echo "<br>";

////////////////////////// ПОДСТАВЛЯЕТ В МАССИВ

//$arr = [];
//for ($i = 1; $i <= 10; $i++) {
//    $arr[] = mt_rand(-100, 100);
//}
//var_dump($arr);
//
//

//////////////////////////
//$arr = [];
//for ($i = 10; $i >= 0; $i--) {
//    // МАССИВ С ЧИСЛАМИ
//    $arr[]  = $i;
//
//}
//var_dump($arr);
//echo  "<br>";
//

////////////////////// ЗАПОЛНЕНИЕ МАССИВА ЧИСЛОМ
//$arr = [];/*
//for ($i = 1; $i <= 10; $i++) {
//
//    // МАССИВ С ЧИСЛАМИ
//    $arr[]  = $i;
//
//    // МАССИВ СО СТРОКАМИ
////    $arr[]  = "xxxxxx";
//
//}
//var_dump($arr);
//echo  "<br*/>";





////////////////////// СУМА ВСЕХ ЧИСЕЛ КОТОРЫЕ ДЕЛЯТСЯ НА 7
$sum =0;
for ($i =0; $i <=100 ;++$i){
    if ($i % 7 == 0){
        $sum +=$i;
    }
//    echo $i."<br>";
 }
echo $sum ."<br>";




/////////////////////////////////////
//$sum =0;
//for ($i =0; $i <=15 ;++$i){
////    echo $i."<br>";
//    echo $sum =$i* $i."<br>";
//}

/////////////////////////////////
$sum = 0;
for ($i = 1; $i <= 15; $i++) {
    $sum += sqrt($i);
}
echo round($sum, 2);